MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J93/mcu.h
extern volatile LCDDATA13bits_t LCDDATA13bits __at(0xF73);
// bitfield macros
#define _LCDDATA13_LCDDATA13_POSN                           0x0
#define _LCDDATA13_LCDDATA13_POSITION                       0x0
#define _LCDDATA13_LCDDATA13_SIZE                           0x8
#define _LCDDATA13_LCDDATA13_LENGTH                         0x8
#define _LCDDATA13_LCDDATA13_MASK                           0xFF
#define _LCDDATA13_S8C2_POSN                                0x0
#define _LCDDATA13_S8C2_POSITION                            0x0
#define _LCDDATA13_S8C2_SIZE                                0x1
#define _LCDDATA13_S8C2_LENGTH                              0x1
#define _LCDDATA13_S8C2_MASK                                0x1
#define _LCDDATA13_S9C2_POSN                                0x1
#define _LCDDATA13_S9C2_POSITION                            0x1
#define _LCDDATA13_S9C2_SIZE                                0x1
#define _LCDDATA13_S9C2_LENGTH                              0x1
#define _LCDDATA13_S9C2_MASK                                0x2
#define _LCDDATA13_S10C2_POSN                               0x2
#define _LCDDATA13_S10C2_POSITION                           0x2
#define _LCDDATA13_S10C2_SIZE                               0x1
#define _LCDDATA13_S10C2_LENGTH                             0x1
#define _LCDDATA13_S10C2_MASK                               0x4
#define _LCDDATA13_S11C2_POSN                               0x3
#define _LCDDATA13_S11C2_POSITION                           0x3
#define _LCDDATA13_S11C2_SIZE                               0x1
#define _LCDDATA13_S11C2_LENGTH                             0x1
#define _LCDDATA13_S11C2_MASK                               0x8
#define _LCDDATA13_S12C2_POSN                               0x4
#define _LCDDATA13_S12C2_POSITION                           0x4
#define _LCDDATA13_S12C2_SIZE                               0x1
#define _LCDDATA13_S12C2_LENGTH                             0x1
#define _LCDDATA13_S12C2_MASK                               0x10
#define _LCDDATA13_S13C2_POSN                               0x5
#define _LCDDATA13_S13C2_POSITION                           0x5
#define _LCDDATA13_S13C2_SIZE                               0x1
#define _LCDDATA13_S13C2_LENGTH                             0x1
#define _LCDDATA13_S13C2_MASK                               0x20
#define _LCDDATA13_S14C2_POSN                               0x6
#define _LCDDATA13_S14C2_POSITION                           0x6
#define _LCDDATA13_S14C2_SIZE                               0x1
#define _LCDDATA13_S14C2_LENGTH                             0x1
#define _LCDDATA13_S14C2_MASK                               0x40
#define _LCDDATA13_S15C2_POSN                               0x7
#define _LCDDATA13_S15C2_POSITION                           0x7
#define _LCDDATA13_S15C2_SIZE                               0x1
#define _LCDDATA13_S15C2_LENGTH                             0x1
#define _LCDDATA13_S15C2_MASK                               0x80
#define _LCDDATA13_SEG8COM2_POSN                            0x0
#define _LCDDATA13_SEG8COM2_POSITION                        0x0
#define _LCDDATA13_SEG8COM2_SIZE                            0x1
#define _LCDDATA13_SEG8COM2_LENGTH                          0x1
#define _LCDDATA13_SEG8COM2_MASK                            0x1
#define _LCDDATA13_SEG9COM2_POSN                            0x1
#define _LCDDATA13_SEG9COM2_POSITION                        0x1
#define _LCDDATA13_SEG9COM2_SIZE                            0x1
#define _LCDDATA13_SEG9COM2_LENGTH                          0x1
#define _LCDDATA13_SEG9COM2_MASK                            0x2
#define _LCDDATA13_SEG10COM2_POSN                           0x2
#define _LCDDATA13_SEG10COM2_POSITION                       0x2
#define _LCDDATA13_SEG10COM2_SIZE                           0x1
#define _LCDDATA13_SEG10COM2_LENGTH                         0x1
#define _LCDDATA13_SEG10COM2_MASK                           0x4
#define _LCDDATA13_SEG11COM2_POSN                           0x3
#define _LCDDATA13_SEG11COM2_POSITION                       0x3
#define _LCDDATA13_SEG11COM2_SIZE                           0x1
#define _LCDDATA13_SEG11COM2_LENGTH                         0x1
#define _LCDDATA13_SEG11COM2_MASK                           0x8
#define _LCDDATA13_SEG12COM2_POSN                           0x4
#define _LCDDATA13_SEG12COM2_POSITION                       0x4
#define _LCDDATA13_SEG12COM2_SIZE                           0x1
#define _LCDDATA13_SEG12COM2_LENGTH                         0x1
#define _LCDDATA13_SEG12COM2_MASK                           0x10
#define _LCDDATA13_SEG13COM2_POSN                           0x5
#define _LCDDATA13_SEG13COM2_POSITION                       0x5
#define _LCDDATA13_SEG13COM2_SIZE                           0x1
#define _LCDDATA13_SEG13COM2_LENGTH                         0x1
#define _LCDDATA13_SEG13COM2_MASK                           0x20
#define _LCDDATA13_SEG14COM2_POSN                           0x6
#define _LCDDATA13_SEG14COM2_POSITION                       0x6
#define _LCDDATA13_SEG14COM2_SIZE                           0x1
#define _LCDDATA13_SEG14COM2_LENGTH                         0x1
#define _LCDDATA13_SEG14COM2_MASK                           0x40
#define _LCDDATA13_SEG15COM2_POSN                           0x7
#define _LCDDATA13_SEG15COM2_POSITION                       0x7
#define _LCDDATA13_SEG15COM2_SIZE                           0x1
#define _LCDDATA13_SEG15COM2_LENGTH                         0x1
#define _LCDDATA13_SEG15COM2_MASK                           0x80
#define _LCDDATA13_S08C2_POSN                               0x0
#define _LCDDATA13_S08C2_POSITION                           0x0
#define _LCDDATA13_S08C2_SIZE                               0x1
#define _LCDDATA13_S08C2_LENGTH                             0x1
#define _LCDDATA13_S08C2_MASK                               0x1
#define _LCDDATA13_S09C2_POSN                               0x1
#define _LCDDATA13_S09C2_POSITION                           0x1
#define _LCDDATA13_S09C2_SIZE                               0x1
#define _LCDDATA13_S09C2_LENGTH                             0x1
#define _LCDDATA13_S09C2_MASK                               0x2

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
extern volatile unsigned char           LCDDATA14           __at(0xF74);
#ifndef _LIB_BUILD
asm("LCDDATA14 equ 0F74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA14              :8;
    };
    struct {
        unsigned S16C2                  :1;
        unsigned S17C2                  :1;
        unsigned S18C2                  :1;
        unsigned S19C2                  :1;
        unsigned S20C2                  :1;
        unsigned S21C2                  :1;
        unsigned S22C2                  :1;
        unsigned S23C2                  :1;
    };
    struct {
        unsigned SEG16COM2              :1;
        unsigned SEG17COM2              :1;
        unsigned SEG18COM2              :1;
        unsigned SEG19COM2              :1;
        unsigned SEG20COM2              :1;
        unsigned SEG21COM2              :1;
        unsigned SEG22COM2              :1;
        unsigned SEG23COM2              :1;
    };
    struct {
        unsigned MSK0                   :1;
        unsigned MSK1                   :1;
        unsigned MSK2                   :1;
        unsigned MSK3                   :1;
        unsigned MSK4                   :1;
        unsigned MSK5                   :1;
        unsigned MSK6                   :1;
        unsigned MSK7                   :1;
    };
} LCDDATA14bits_t;
extern volatile LCDDATA14bits_t LCDDATA14bits __at(0xF74);
// bitfield macros
#define _LCDDATA14_LCDDATA14_POSN                           0x0
#define _LCDDATA14_LCDDATA14_POSITION                       0x0
#define _LCDDATA14_LCDDATA14_SIZE                           0x8
#define _LCDDATA14_LCDDATA14_LENGTH                         0x8
#define _LCDDATA14_LCDDATA14_MASK                           0xFF
#define _LCDDATA14_S16C2_POSN                               0x0
#define _LCDDATA14_S16C2_POSITION                           0x0
#define _LCDDATA14_S16C2_SIZE                               0x1
#define _LCDDATA14_S16C2_LENGTH                             0x1
#define _LCDDATA14_S16C2_MASK                               0x1
#define _LCDDATA14_S17C2_POSN                               0x1
#define _LCDDATA14_S17C2_POSITION                           0x1
#define _LCDDATA14_S17C2_SIZE                               0x1
#define _LCDDATA14_S17C2_LENGTH                             0x1
#define _LCDDATA14_S17C2_MASK                               0x2
#define _LCDDATA14_S18C2_POSN                               0x2
#define _LCDDATA14_S18C2_POSITION                           0x2
#define _LCDDATA14_S18C2_SIZE                               0x1
#define _LCDDATA14_S18C2_LENGTH                             0x1
#define _LCDDATA14_S18C2_MASK                               0x4
#define _LCDDATA14_S19C2_POSN                               0x3
#define _LCDDATA14_S19C2_POSITION                           0x3
#define _LCDDATA14_S19C2_SIZE                               0x1
#define _LCDDATA14_S19C2_LENGTH                             0x1
#define _LCDDATA14_S19C2_MASK                               0x8
#define _LCDDATA14_S20C2_POSN                               0x4
#define _LCDDATA14_S20C2_POSITION                           0x4
#define _LCDDATA14_S20C2_SIZE                               0x1
#define _LCDDATA14_S20C2_LENGTH                             0x1
#define _LCDDATA14_S20C2_MASK                               0x10
#define _LCDDATA14_S21C2_POSN                               0x5
#define _LCDDATA14_S21C2_POSITION                           0x5
#define _LCDDATA14_S21C2_SIZE                               0x1
#define _LCDDATA14_S21C2_LENGTH                             0x1
#define _LCDDATA14_S21C2_MASK                               0x20
#define _LCDDATA14_S22C2_POSN                               0x6
#define _LCDDATA14_S22C2_POSITION                           0x6
#define _LCDDATA14_S22C2_SIZE                               0x1
#define _LCDDATA14_S22C2_LENGTH                             0x1
#define _LCDDATA14_S22C2_MASK                               0x40
#define _LCDDATA14_S23C2_POSN                               0x7
#define _LCDDATA14_S23C2_POSITION                           0x7
#define _LCDDATA14_S23C2_SIZE                               0x1
#define _LCDDATA14_S23C2_LENGTH                             0x1
#define _LCDDATA14_S23C2_MASK                               0x80
#define _LCDDATA14_SEG16COM2_POSN                           0x0
#define _LCDDATA14_SEG16COM2_POSITION                       0x0
#define _LCDDATA14_SEG16COM2_SIZE                           0x1
#define _LCDDATA14_SEG16COM2_LENGTH                         0x1
#define _LCDDATA14_SEG16COM2_MASK                           0x1
#define _LCDDATA14_SEG17COM2_POSN                           0x1
#define _LCDDATA14_SEG17COM2_POSITION                       0x1
#define _LCDDATA14_SEG17COM2_SIZE                           0x1
#define _LCDDATA14_SEG17COM2_LENGTH                         0x1
#define _LCDDATA14_SEG17COM2_MASK                           0x2
#define _LCDDATA14_SEG18COM2_POSN                           0x2
#define _LCDDATA14_SEG18COM2_POSITION                       0x2
#define _LCDDATA14_SEG18COM2_SIZE                           0x1
#define _LCDDATA14_SEG18COM2_LENGTH                         0x1
#define _LCDDATA14_SEG18COM2_MASK                           0x4
#define _LCDDATA14_SEG19COM2_POSN                           0x3
#define _LCDDATA14_SEG19COM2_POSITION                       0x3
#define _LCDDATA14_SEG19COM2_SIZE                           0x1
#define _LCDDATA14_SEG19COM2_LENGTH                         0x1
#define _LCDDATA14_SEG19COM2_MASK                           0x8
#define _LCDDATA14_SEG20COM2_POSN                           0x4
#define _LCDDATA14_SEG20COM2_POSITION                       0x4
#define _LCDDATA14_SEG20COM2_SIZE                           0x1
#define _LCDDATA14_SEG20COM2_LENGTH                         0x1
#define _LCDDATA14_SEG20COM2_MASK                           0x10
#define _LCDDATA14_SEG21COM2_POSN                           0x5
#define _LCDDATA14_SEG21COM2_POSITION                       0x5
#define _LCDDATA14_SEG21COM2_SIZE                           0x1
#define _LCDDATA14_SEG21COM2_LENGTH                         0x1
#define _LCDDATA14_SEG21COM2_MASK                           0x20
#define _LCDDATA14_SEG22COM2_POSN                           0x6
#define _LCDDATA14_SEG22COM2_POSITION                       0x6
#define _LCDDATA14_SEG22COM2_SIZE                           0x1
#define _LCDDATA14_SEG22COM2_LENGTH                         0x1
#define _LCDDATA14_SEG22COM2_MASK                           0x40
#define _LCDDATA14_SEG23COM2_POSN                           0x7
#define _LCDDATA14_SEG23COM2_POSITION                       0x7
#define _LCDDATA14_SEG23COM2_SIZE                           0x1
#define _LCDDATA14_SEG23COM2_LENGTH                         0x1
#define _LCDDATA14_SEG23COM2_MASK                           0x80
#define _LCDDATA14_MSK0_POSN                                0x0
#define _LCDDATA14_MSK0_POSITION                            0x0
#define _LCDDATA14_MSK0_SIZE                                0x1
#define _LCDDATA14_MSK0_LENGTH                              0x1
#define _LCDDATA14_MSK0_MASK                                0x1
#define _LCDDATA14_MSK1_POSN                                0x1
#define _LCDDATA14_MSK1_POSITION                            0x1
#define _LCDDATA14_MSK1_SIZE                                0x1
#define _LCDDATA14_MSK1_LENGTH                              0x1
#define _LCDDATA14_MSK1_MASK                                0x2
#define _LCDDATA14_MSK2_POSN                                0x2
#define _LCDDATA14_MSK2_POSITION                            0x2
#define _LCDDATA14_MSK2_SIZE                                0x1
#define _LCDDATA14_MSK2_LENGTH                              0x1
#define _LCDDATA14_MSK2_MASK                                0x4
#define _LCDDATA14_MSK3_POSN                                0x3
#define _LCDDATA14_MSK3_POSITION                            0x3
#define _LCDDATA14_MSK3_SIZE                                0x1
#define _LCDDATA14_MSK3_LENGTH                              0x1
#define _LCDDATA14_MSK3_MASK                                0x8
#define _LCDDATA14_MSK4_POSN                                0x4
#define _LCDDATA14_MSK4_POSITION                            0x4
#define _LCDDATA14_MSK4_SIZE                                0x1
#define _LCDDATA14_MSK4_LENGTH                              0x1
#define _LCDDATA14_MSK4_MASK                                0x10
#define _LCDDATA14_MSK5_POSN                                0x5
#define _LCDDATA14_MSK5_POSITION                            0x5
#define _LCDDATA14_MSK5_SIZE                                0x1
#define _LCDDATA14_MSK5_LENGTH                              0x1
#define _LCDDATA14_MSK5_MASK                                0x20
#define _LCDDATA14_MSK6_POSN                                0x6
#define _LCDDATA14_MSK6_POSITION                            0x6
#define _LCDDATA14_MSK6_SIZE                                0x1
#define _LCDDATA14_MSK6_LENGTH                              0x1
#define _LCDDATA14_MSK6_MASK                                0x40
#define _LCDDATA14_MSK7_POSN                                0x7
#define _LCDDATA14_MSK7_POSITION                            0x7
#define _LCDDATA14_MSK7_SIZE                                0x1
#define _LCDDATA14_MSK7_LENGTH                              0x1
#define _LCDDATA14_MSK7_MASK                                0x80

