MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J93/mcu.h
#define                                 S43C3_bit           _BIT_ACCESS(LCDDATA23,3)
// LCDDATA5<S44C0>
extern volatile __bit                   S44C0               __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 S44C0_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA11<S44C1>
extern volatile __bit                   S44C1               __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 S44C1_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA17<S44C2>
extern volatile __bit                   S44C2               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 S44C2_bit           _BIT_ACCESS(LCDDATA17,4)
// LCDDATA23<S44C3>
extern volatile __bit                   S44C3               __at(0x7BEC);	// @ (0xF7D * 8 + 4)
#define                                 S44C3_bit           _BIT_ACCESS(LCDDATA23,4)
// LCDDATA5<S45C0>
extern volatile __bit                   S45C0               __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 S45C0_bit           _BIT_ACCESS(LCDDATA5,5)
// LCDDATA11<S45C1>
extern volatile __bit                   S45C1               __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 S45C1_bit           _BIT_ACCESS(LCDDATA11,5)
// LCDDATA17<S45C2>
extern volatile __bit                   S45C2               __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 S45C2_bit           _BIT_ACCESS(LCDDATA17,5)
// LCDDATA23<S45C3>
extern volatile __bit                   S45C3               __at(0x7BED);	// @ (0xF7D * 8 + 5)
#define                                 S45C3_bit           _BIT_ACCESS(LCDDATA23,5)
// LCDDATA5<S46C0>
extern volatile __bit                   S46C0               __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 S46C0_bit           _BIT_ACCESS(LCDDATA5,6)
// LCDDATA11<S46C1>
extern volatile __bit                   S46C1               __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 S46C1_bit           _BIT_ACCESS(LCDDATA11,6)
// LCDDATA17<S46C2>
extern volatile __bit                   S46C2               __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 S46C2_bit           _BIT_ACCESS(LCDDATA17,6)
// LCDDATA23<S46C3>
extern volatile __bit                   S46C3               __at(0x7BEE);	// @ (0xF7D * 8 + 6)
#define                                 S46C3_bit           _BIT_ACCESS(LCDDATA23,6)
// LCDDATA5<S47C0>
extern volatile __bit                   S47C0               __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 S47C0_bit           _BIT_ACCESS(LCDDATA5,7)
// LCDDATA11<S47C1>
extern volatile __bit                   S47C1               __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 S47C1_bit           _BIT_ACCESS(LCDDATA11,7)
// LCDDATA17<S47C2>
extern volatile __bit                   S47C2               __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 S47C2_bit           _BIT_ACCESS(LCDDATA17,7)
// LCDDATA23<S47C3>
extern volatile __bit                   S47C3               __at(0x7BEF);	// @ (0xF7D * 8 + 7)
#define                                 S47C3_bit           _BIT_ACCESS(LCDDATA23,7)
// LCDDATA0<S4C0>
extern volatile __bit                   S4C0                __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 S4C0_bit            _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<S4C1>
extern volatile __bit                   S4C1                __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 S4C1_bit            _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<S4C2>
extern volatile __bit                   S4C2                __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 S4C2_bit            _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<S4C3>
extern volatile __bit                   S4C3                __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 S4C3_bit            _BIT_ACCESS(LCDDATA18,4)
// LCDDATA0<S5C0>
extern volatile __bit                   S5C0                __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 S5C0_bit            _BIT_ACCESS(LCDDATA0,5)
// LCDDATA6<S5C1>
extern volatile __bit                   S5C1                __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 S5C1_bit            _BIT_ACCESS(LCDDATA6,5)
// LCDDATA12<S5C2>
extern volatile __bit                   S5C2                __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 S5C2_bit            _BIT_ACCESS(LCDDATA12,5)
// LCDDATA18<S5C3>
extern volatile __bit                   S5C3                __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 S5C3_bit            _BIT_ACCESS(LCDDATA18,5)
// LCDDATA0<S6C0>
extern volatile __bit                   S6C0                __at(0x7DDE);	// @ (0xFBB * 8 + 6)
#define                                 S6C0_bit            _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<S6C1>
extern volatile __bit                   S6C1                __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 S6C1_bit            _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<S6C2>
extern volatile __bit                   S6C2                __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 S6C2_bit            _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<S6C3>
extern volatile __bit                   S6C3                __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 S6C3_bit            _BIT_ACCESS(LCDDATA18,6)
// LCDDATA0<S7C0>
extern volatile __bit                   S7C0                __at(0x7DDF);	// @ (0xFBB * 8 + 7)
#define                                 S7C0_bit            _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<S7C1>
extern volatile __bit                   S7C1                __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 S7C1_bit            _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<S7C2>
extern volatile __bit                   S7C2                __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 S7C2_bit            _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<S7C3>
extern volatile __bit                   S7C3                __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 S7C3_bit            _BIT_ACCESS(LCDDATA18,7)
// LCDDATA1<S8C0>
extern volatile __bit                   S8C0                __at(0x7DE0);	// @ (0xFBC * 8 + 0)
#define                                 S8C0_bit            _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<S8C1>
extern volatile __bit                   S8C1                __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 S8C1_bit            _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<S8C2>
extern volatile __bit                   S8C2                __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 S8C2_bit            _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<S8C3>
extern volatile __bit                   S8C3                __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 S8C3_bit            _BIT_ACCESS(LCDDATA19,0)
// LCDDATA1<S9C0>
extern volatile __bit                   S9C0                __at(0x7DE1);	// @ (0xFBC * 8 + 1)
#define                                 S9C0_bit            _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<S9C1>
extern volatile __bit                   S9C1                __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 S9C1_bit            _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<S9C2>
extern volatile __bit                   S9C2                __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 S9C2_bit            _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<S9C3>
extern volatile __bit                   S9C3                __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 S9C3_bit            _BIT_ACCESS(LCDDATA19,1)
// PORTC<SCK>
extern volatile __bit                   SCK                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCK_bit             _BIT_ACCESS(PORTC,3)
// BAUDCON1<SCKP>
extern volatile __bit                   SCKP                __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON1,4)
// BAUDCON1<SCKP1>
extern volatile __bit                   SCKP1               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTC<SCL>
extern volatile __bit                   SCL                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCL_bit             _BIT_ACCESS(PORTC,3)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// PORTC<SDA>
extern volatile __bit                   SDA                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDA_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDI>
extern volatile __bit                   SDI                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDI_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDO>
extern volatile __bit                   SDO                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SDO_bit             _BIT_ACCESS(PORTC,5)
// LCDSE0<SE0>
extern volatile __bit                   SE0                 __at(0x7D48);	// @ (0xFA9 * 8 + 0)
#define                                 SE0_bit             _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE00>
extern volatile __bit                   SE00                __at(0x7D48);	// @ (0xFA9 * 8 + 0)
#define                                 SE00_bit            _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE01>
extern volatile __bit                   SE01                __at(0x7D49);	// @ (0xFA9 * 8 + 1)
#define                                 SE01_bit            _BIT_ACCESS(LCDSE0,1)
// LCDSE0<SE02>
extern volatile __bit                   SE02                __at(0x7D4A);	// @ (0xFA9 * 8 + 2)
#define                                 SE02_bit            _BIT_ACCESS(LCDSE0,2)
// LCDSE0<SE03>
extern volatile __bit                   SE03                __at(0x7D4B);	// @ (0xFA9 * 8 + 3)
#define                                 SE03_bit            _BIT_ACCESS(LCDSE0,3)
// LCDSE0<SE04>
extern volatile __bit                   SE04                __at(0x7D4C);	// @ (0xFA9 * 8 + 4)
#define                                 SE04_bit            _BIT_ACCESS(LCDSE0,4)
// LCDSE0<SE05>
extern volatile __bit                   SE05                __at(0x7D4D);	// @ (0xFA9 * 8 + 5)
#define                                 SE05_bit            _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE06>
extern volatile __bit                   SE06                __at(0x7D4E);	// @ (0xFA9 * 8 + 6)
#define                                 SE06_bit            _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE07>
extern volatile __bit                   SE07                __at(0x7D4F);	// @ (0xFA9 * 8 + 7)
#define                                 SE07_bit            _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE08>
extern volatile __bit                   SE08                __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 SE08_bit            _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE09>
extern volatile __bit                   SE09                __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 SE09_bit            _BIT_ACCESS(LCDSE1,1)
// LCDSE0<SE1>
extern volatile __bit                   SE1                 __at(0x7D49);	// @ (0xFA9 * 8 + 1)
#define                                 SE1_bit             _BIT_ACCESS(LCDSE0,1)
// LCDSE1<SE10>
extern volatile __bit                   SE10                __at(0x7DB2);	// @ (0xFB6 * 8 + 2)
#define                                 SE10_bit            _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SE11>
extern volatile __bit                   SE11                __at(0x7DB3);	// @ (0xFB6 * 8 + 3)
#define                                 SE11_bit            _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SE12>
extern volatile __bit                   SE12                __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 SE12_bit            _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SE13>
extern volatile __bit                   SE13                __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 SE13_bit            _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SE14>
extern volatile __bit                   SE14                __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 SE14_bit            _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SE15>
extern volatile __bit                   SE15                __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 SE15_bit            _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SE16>
extern volatile __bit                   SE16                __at(0x7DB8);	// @ (0xFB7 * 8 + 0)
#define                                 SE16_bit            _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SE17>
extern volatile __bit                   SE17                __at(0x7DB9);	// @ (0xFB7 * 8 + 1)
#define                                 SE17_bit            _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SE18>
extern volatile __bit                   SE18                __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 SE18_bit            _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SE19>
extern volatile __bit                   SE19                __at(0x7DBB);	// @ (0xFB7 * 8 + 3)
#define                                 SE19_bit            _BIT_ACCESS(LCDSE2,3)
// LCDSE0<SE2>
extern volatile __bit                   SE2                 __at(0x7D4A);	// @ (0xFA9 * 8 + 2)
#define                                 SE2_bit             _BIT_ACCESS(LCDSE0,2)
// LCDSE2<SE20>
extern volatile __bit                   SE20                __at(0x7DBC);	// @ (0xFB7 * 8 + 4)
#define                                 SE20_bit            _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SE21>
extern volatile __bit                   SE21                __at(0x7DBD);	// @ (0xFB7 * 8 + 5)
#define                                 SE21_bit            _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SE22>
extern volatile __bit                   SE22                __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 SE22_bit            _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SE23>
extern volatile __bit                   SE23                __at(0x7DBF);	// @ (0xFB7 * 8 + 7)
#define                                 SE23_bit            _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SE24>
extern volatile __bit                   SE24                __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 SE24_bit            _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SE25>
extern volatile __bit                   SE25                __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 SE25_bit            _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SE26>
extern volatile __bit                   SE26                __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 SE26_bit            _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SE27>
extern volatile __bit                   SE27                __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 SE27_bit            _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SE28>
extern volatile __bit                   SE28                __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 SE28_bit            _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SE29>
extern volatile __bit                   SE29                __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 SE29_bit            _BIT_ACCESS(LCDSE3,5)
// LCDSE0<SE3>
extern volatile __bit                   SE3                 __at(0x7D4B);	// @ (0xFA9 * 8 + 3)
#define                                 SE3_bit             _BIT_ACCESS(LCDSE0,3)
// LCDSE3<SE30>
extern volatile __bit                   SE30                __at(0x7DC6);	// @ (0xFB8 * 8 + 6)
#define                                 SE30_bit            _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SE31>
extern volatile __bit                   SE31                __at(0x7DC7);	// @ (0xFB8 * 8 + 7)
#define                                 SE31_bit            _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SE32>
extern volatile __bit                   SE32                __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SE33>
extern volatile __bit                   SE33                __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 SE33_bit            _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SE34>
extern volatile __bit                   SE34                __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 SE34_bit            _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SE35>
extern volatile __bit                   SE35                __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 SE35_bit            _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SE36>
extern volatile __bit                   SE36                __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 SE36_bit            _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SE37>
extern volatile __bit                   SE37                __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 SE37_bit            _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SE38>
extern volatile __bit                   SE38                __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 SE38_bit            _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SE39>
extern volatile __bit                   SE39                __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 SE39_bit            _BIT_ACCESS(LCDSE4,7)
// LCDSE0<SE4>
extern volatile __bit                   SE4                 __at(0x7D4C);	// @ (0xFA9 * 8 + 4)
#define                                 SE4_bit             _BIT_ACCESS(LCDSE0,4)
// LCDSE5<SE40>
extern volatile __bit                   SE40                __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 SE40_bit            _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SE41>
extern volatile __bit                   SE41                __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 SE41_bit            _BIT_ACCESS(LCDSE5,1)
// LCDSE5<SE42>
extern volatile __bit                   SE42                __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 SE42_bit            _BIT_ACCESS(LCDSE5,2)
// LCDSE5<SE43>
extern volatile __bit                   SE43                __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 SE43_bit            _BIT_ACCESS(LCDSE5,3)
// LCDSE5<SE44>
extern volatile __bit                   SE44                __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 SE44_bit            _BIT_ACCESS(LCDSE5,4)
// LCDSE5<SE45>
extern volatile __bit                   SE45                __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 SE45_bit            _BIT_ACCESS(LCDSE5,5)
// LCDSE5<SE46>
extern volatile __bit                   SE46                __at(0x7DD6);	// @ (0xFBA * 8 + 6)
#define                                 SE46_bit            _BIT_ACCESS(LCDSE5,6)
// LCDSE5<SE47>
extern volatile __bit                   SE47                __at(0x7DD7);	// @ (0xFBA * 8 + 7)
#define                                 SE47_bit            _BIT_ACCESS(LCDSE5,7)
// LCDSE0<SE5>
extern volatile __bit                   SE5                 __at(0x7D4D);	// @ (0xFA9 * 8 + 5)
#define                                 SE5_bit             _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE6>
extern volatile __bit                   SE6                 __at(0x7D4E);	// @ (0xFA9 * 8 + 6)
#define                                 SE6_bit             _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE7>
extern volatile __bit                   SE7                 __at(0x7D4F);	// @ (0xFA9 * 8 + 7)
#define                                 SE7_bit             _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE8>
extern volatile __bit                   SE8                 __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 SE8_bit             _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE9>
extern volatile __bit                   SE9                 __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 SE9_bit             _BIT_ACCESS(LCDSE1,1)
// PORTD<SEG0>
extern volatile __bit                   SEG0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 SEG0_bit            _BIT_ACCESS(PORTD,0)
// LCDDATA18<SEG00COM3>
extern volatile __bit                   SEG00COM3           __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 SEG00COM3_bit       _BIT_ACCESS(LCDDATA18,0)
// LCDDATA18<SEG01COM3>
extern volatile __bit                   SEG01COM3           __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 SEG01COM3_bit       _BIT_ACCESS(LCDDATA18,1)
// LCDDATA18<SEG02COM3>
extern volatile __bit                   SEG02COM3           __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 SEG02COM3_bit       _BIT_ACCESS(LCDDATA18,2)
// LCDDATA18<SEG03COM3>
extern volatile __bit                   SEG03COM3           __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 SEG03COM3_bit       _BIT_ACCESS(LCDDATA18,3)
// LCDDATA18<SEG04COM3>
extern volatile __bit                   SEG04COM3           __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 SEG04COM3_bit       _BIT_ACCESS(LCDDATA18,4)
// LCDDATA18<SEG05COM3>
extern volatile __bit                   SEG05COM3           __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 SEG05COM3_bit       _BIT_ACCESS(LCDDATA18,5)
// LCDDATA18<SEG06COM3>
extern volatile __bit                   SEG06COM3           __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 SEG06COM3_bit       _BIT_ACCESS(LCDDATA18,6)
// LCDDATA18<SEG07COM3>
extern volatile __bit                   SEG07COM3           __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 SEG07COM3_bit       _BIT_ACCESS(LCDDATA18,7)
// LCDDATA0<SEG0COM0>
extern volatile __bit                   SEG0COM0            __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 SEG0COM0_bit        _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<SEG0COM1>
extern volatile __bit                   SEG0COM1            __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 SEG0COM1_bit        _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<SEG0COM2>
extern volatile __bit                   SEG0COM2            __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 SEG0COM2_bit        _BIT_ACCESS(LCDDATA12,0)
// PORTD<SEG1>
extern volatile __bit                   SEG1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 SEG1_bit            _BIT_ACCESS(PORTD,1)
// PORTB<SEG10>
extern volatile __bit                   SEG10               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 SEG10_bit           _BIT_ACCESS(PORTB,3)
// LCDDATA1<SEG10COM0>
extern volatile __bit                   SEG10COM0           __at(0x7DE2);	// @ (0xFBC * 8 + 2)
#define                                 SEG10COM0_bit       _BIT_ACCESS(LCDDATA1,2)
// LCDDATA7<SEG10COM1>
